In [1]:
import pandas as pd

In [3]:
CCTV_Seoul = pd.read_csv('../data/01. CCTV_in_Seoul.csv', encoding = 'utf-8')
CCTV_Seoul.head()

   기관명    소계  2013년도 이전  2014년  2015년  2016년
0  강남구  2780       1292    430    584    932
1  강동구   773        379     99    155    377
2  강북구   748        369    120    138    204
3  강서구   884        388    258    184     81
4  관악구  1496        846    260    390    613

In [4]:
CCTV_Seoul.columns

Index(['기관명', '소계', '2013년도 이전', '2014년', '2015년', '2016년'], dtype='object')

In [5]:
CCTV_Seoul.columns[0]

'기관명'

In [13]:
CCTV_Seoul.rename(columns={CCTV_Seoul.columns[0] : '구별'}, inplace = True)
CCTV_Seoul.head()

    구별    소계  2013년도 이전  2014년  2015년  2016년
0  강남구  2780       1292    430    584    932
1  강동구   773        379     99    155    377
2  강북구   748        369    120    138    204
3  강서구   884        388    258    184     81
4  관악구  1496        846    260    390    613

In [16]:
pop_Seoul = pd.read_excel('../data/01. population_in_Seoul.xls',
                          header = 2,
                          usecols= 'B, D, G, J, N',
                          encoding = 'utf-8')
pop_Seoul.head()

   자치구           계        계.1       계.2   65세이상고령자
0   합계  10197604.0  9926968.0  270636.0  1321458.0
1  종로구    162820.0   153589.0    9231.0    25425.0
2   중구    133240.0   124312.0    8928.0    20764.0
3  용산구    244203.0   229456.0   14747.0    36231.0
4  성동구    311244.0   303380.0    7864.0    39997.0

In [23]:
pop_Seoul.rename(columns={pop_Seoul.columns[0] : '구별',
                         pop_Seoul.columns[1] : '인구 수',
                         pop_Seoul.columns[2] : '한국인',
                         pop_Seoul.columns[3] : '외국인',
                         pop_Seoul.columns[4] : '고령자'}, inplace = True)
pop_Seoul.head()

    구별        인구 수        한국인       외국인        고령자
0   합계  10197604.0  9926968.0  270636.0  1321458.0
1  종로구    162820.0   153589.0    9231.0    25425.0
2   중구    133240.0   124312.0    8928.0    20764.0
3  용산구    244203.0   229456.0   14747.0    36231.0
4  성동구    311244.0   303380.0    7864.0    39997.0

### pandas 기초 익히기

In [26]:
import pandas as pd
import numpy as np

In [27]:
s = pd.Series([1,3,5,np.nan,6,8])
s

0    1.0
1    3.0
2    5.0
3    NaN
4    6.0
5    8.0
dtype: float64

* NaN은 Not A Number.

In [30]:
dates = pd.date_range('20201109', periods=6)
dates

DatetimeIndex(['2020-11-09', '2020-11-10', '2020-11-11', '2020-11-12',
               '2020-11-13', '2020-11-14'],
              dtype='datetime64[ns]', freq='D')

* pandas에는 날짜형 데이터 date_range가 있다
* periods 옵션 : 6일 간이라 지정

In [33]:
df = pd.DataFrame(np.random.randn(6,4), index=dates, columns=['A','B','C','D'])
df

                   A         B         C         D
2020-11-09  1.556292  0.309726 -0.165791 -0.587107
2020-11-10 -0.275941 -0.459333 -0.896176  0.795974
2020-11-11  0.350726 -0.017860  0.137921  1.892543
2020-11-12  0.049141  0.121610  0.793791 -3.154830
2020-11-13  0.671041  1.291864  2.027798 -1.435069
2020-11-14  0.772325 -0.231398  0.304636  0.219861

* np.random.randn(6,4) : 6행 4열의 랜덤 변수 만들기
* index 옵션으로 행 인덱스 지정 가능
* columns 옵션으로 열 이름 지정 가능

In [35]:
df.head(3)

                   A         B         C         D
2020-11-09  1.556292  0.309726 -0.165791 -0.587107
2020-11-10 -0.275941 -0.459333 -0.896176  0.795974
2020-11-11  0.350726 -0.017860  0.137921  1.892543

* head() : 첫 행 5개를 디폴트로 보여주며, 괄호 안에 숫자를 넣어주어 해당 숫자만큼의 행 볼 수.

In [36]:
df.index # 인덱스 확인

DatetimeIndex(['2020-11-09', '2020-11-10', '2020-11-11', '2020-11-12',
               '2020-11-13', '2020-11-14'],
              dtype='datetime64[ns]', freq='D')

In [38]:
df.columns # 컬럼 확인

Index(['A', 'B', 'C', 'D'], dtype='object')

In [39]:
df.values # 내용물

array([[ 1.55629201,  0.3097262 , -0.16579069, -0.58710741],
       [-0.2759407 , -0.45933349, -0.89617606,  0.79597402],
       [ 0.35072571, -0.01785992,  0.13792063,  1.89254271],
       [ 0.0491407 ,  0.12161007,  0.79379123, -3.15483018],
       [ 0.67104072,  1.29186394,  2.02779844, -1.43506885],
       [ 0.772325  , -0.23139837,  0.30463581,  0.2198608 ]])

In [41]:
df.info() # 개요 확인

<class 'pandas.core.frame.DataFrame'>
DatetimeIndex: 6 entries, 2020-11-09 to 2020-11-14
Freq: D
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   A       6 non-null      float64
 1   B       6 non-null      float64
 2   C       6 non-null      float64
 3   D       6 non-null      float64
dtypes: float64(4)
memory usage: 240.0 bytes

In [42]:
df.describe() # 통계적 개요 확인

              A         B         C         D
count  6.000000  6.000000  6.000000  6.000000
mean   0.520597  0.169101  0.367030 -0.378105
std    0.639416  0.612031  0.987547  1.775552
min   -0.275941 -0.459333 -0.896176 -3.154830
25%    0.124537 -0.178014 -0.089863 -1.223078
50%    0.510883  0.051875  0.221278 -0.183623
75%    0.747004  0.262697  0.671502  0.651946
max    1.556292  1.291864  2.027798  1.892543

* describe() : 데이터프레임의 values가 숫자가 아니라 문자이더라도 이에 맞는 개요 확인 가능!

In [44]:
df.sort_values(by = 'A', ascending = False)

                   A         B         C         D
2020-11-09  1.556292  0.309726 -0.165791 -0.587107
2020-11-14  0.772325 -0.231398  0.304636  0.219861
2020-11-13  0.671041  1.291864  2.027798 -1.435069
2020-11-11  0.350726 -0.017860  0.137921  1.892543
2020-11-12  0.049141  0.121610  0.793791 -3.154830
2020-11-10 -0.275941 -0.459333 -0.896176  0.795974

* sort_values() : by로 지정한 컬럼 기준으로 정렬.
* ascending 옵션으로 오름차순 / 내림차순 정렬

In [45]:
df['A']

2020-11-09    1.556292
2020-11-10   -0.275941
2020-11-11    0.350726
2020-11-12    0.049141
2020-11-13    0.671041
2020-11-14    0.772325
Freq: D, Name: A, dtype: float64

* 해당 컬럼만 Series로 보여줌

In [48]:
df[0:3] # 행의 범위 지정 가능

                   A         B         C         D
2020-11-09  1.556292  0.309726 -0.165791 -0.587107
2020-11-10 -0.275941 -0.459333 -0.896176  0.795974
2020-11-11  0.350726 -0.017860  0.137921  1.892543

In [49]:
df['2020-11-11':'2020-11-14'] # 행의 범위 지정 가능

                   A         B         C         D
2020-11-11  0.350726 -0.017860  0.137921  1.892543
2020-11-12  0.049141  0.121610  0.793791 -3.154830
2020-11-13  0.671041  1.291864  2.027798 -1.435069
2020-11-14  0.772325 -0.231398  0.304636  0.219861

In [50]:
dates

DatetimeIndex(['2020-11-09', '2020-11-10', '2020-11-11', '2020-11-12',
               '2020-11-13', '2020-11-14'],
              dtype='datetime64[ns]', freq='D')

### df.loc : 특정 행 데이터가 보고 싶을 때

In [54]:
df.loc['2020-11-09']

A    1.556292
B    0.309726
C   -0.165791
D   -0.587107
Name: 2020-11-09 00:00:00, dtype: float64

In [56]:
df.loc[dates[0]]

A    1.556292
B    0.309726
C   -0.165791
D   -0.587107
Name: 2020-11-09 00:00:00, dtype: float64

In [57]:
df.loc[:,['A','B']]

                   A         B
2020-11-09  1.556292  0.309726
2020-11-10 -0.275941 -0.459333
2020-11-11  0.350726 -0.017860
2020-11-12  0.049141  0.121610
2020-11-13  0.671041  1.291864
2020-11-14  0.772325 -0.231398

* A, B 열의 모든 행이 보고 싶을 때

In [59]:
df.loc['2020-11-11':'2020-11-14',['A','B']] # 행과 열의 범위 모두 지정

                   A         B
2020-11-11  0.350726 -0.017860
2020-11-12  0.049141  0.121610
2020-11-13  0.671041  1.291864
2020-11-14  0.772325 -0.231398

In [60]:
df.loc['2020-11-14',['D','B']] # 행과 열의 범위 모두 지정

D    0.219861
B   -0.231398
Name: 2020-11-14 00:00:00, dtype: float64

### df.iloc : 행과 열의 번호를 이용해 데이터에 바로 접근할 때

In [62]:
#df.loc[3] -> 에러
df.iloc[3]

A    0.049141
B    0.121610
C    0.793791
D   -3.154830
Name: 2020-11-12 00:00:00, dtype: float64

* 행 인덱스가 3인, 즉 2020-11-12 행의 데이터

In [65]:
df.iloc[3:5, 0:2]

                   A         B
2020-11-12  0.049141  0.121610
2020-11-13  0.671041  1.291864

* 3번째, 4번째 행과 0번째, 1번째 열 데이터

In [66]:
df.iloc[[1,2,4],[0,2]]

                   A         C
2020-11-10 -0.275941 -0.896176
2020-11-11  0.350726  0.137921
2020-11-13  0.671041  2.027798

In [68]:
df.iloc[1:3, :]

                   A         B         C         D
2020-11-10 -0.275941 -0.459333 -0.896176  0.795974
2020-11-11  0.350726 -0.017860  0.137921  1.892543

In [69]:
df.iloc[:,1:3]

                   B         C
2020-11-09  0.309726 -0.165791
2020-11-10 -0.459333 -0.896176
2020-11-11 -0.017860  0.137921
2020-11-12  0.121610  0.793791
2020-11-13  1.291864  2.027798
2020-11-14 -0.231398  0.304636

### 특정 조건 만족하는 데이터 추출

In [72]:
df[df.A > 1]

                   A         B         C         D
2020-11-09  1.556292  0.309726 -0.165791 -0.587107

*  컬럼 A에서 1보다 큰 행만 얻기

In [73]:
df[df > 1]

                   A         B         C         D
2020-11-09  1.556292       NaN       NaN       NaN
2020-11-10       NaN       NaN       NaN       NaN
2020-11-11       NaN       NaN       NaN  1.892543
2020-11-12       NaN       NaN       NaN       NaN
2020-11-13       NaN  1.291864  2.027798       NaN
2020-11-14       NaN       NaN       NaN       NaN

* 이렇게 데이터 전체에서 조건을 걸면, 만족하지 않는 곳은 NaN 처리가 된다

### 데이터프레임의 복사 (copy)

In [80]:
df
df2 = df

In [81]:
df2

                   A         B         C         D
2020-11-10 -0.275941 -0.459333 -0.896176  0.795974
2020-11-12  0.049141  0.121610  0.793791 -3.154830
2020-11-11  0.350726 -0.017860  0.137921  1.892543
2020-11-13  0.671041  1.291864  2.027798 -1.435069
2020-11-14  0.772325 -0.231398  0.304636  0.219861
2020-11-09  1.556292  0.309726 -0.165791 -0.587107

In [84]:
df.sort_values(ascending = True, by = 'B', inplace = True)

In [85]:
df

                   A         B         C         D
2020-11-10 -0.275941 -0.459333 -0.896176  0.795974
2020-11-14  0.772325 -0.231398  0.304636  0.219861
2020-11-11  0.350726 -0.017860  0.137921  1.892543
2020-11-12  0.049141  0.121610  0.793791 -3.154830
2020-11-09  1.556292  0.309726 -0.165791 -0.587107
2020-11-13  0.671041  1.291864  2.027798 -1.435069

In [86]:
df2

                   A         B         C         D
2020-11-10 -0.275941 -0.459333 -0.896176  0.795974
2020-11-14  0.772325 -0.231398  0.304636  0.219861
2020-11-11  0.350726 -0.017860  0.137921  1.892543
2020-11-12  0.049141  0.121610  0.793791 -3.154830
2020-11-09  1.556292  0.309726 -0.165791 -0.587107
2020-11-13  0.671041  1.291864  2.027798 -1.435069

* 이처럼, 단순히 = 로 데이터프레임 복사하면 **실제 데이터 내용이 복사되는 것이 아니라 위치만 복사**
* 원본 데이터프레임에서 변경, 수정이 있을 경우 똑같이 수정이 된다.
* 따라서 온전한 복사를 통한 백업이 목적이라면 = 를 사용하면 안된다.

#### copy() : 데이터 내용까지 온전히 복사

In [87]:
df3 = df.copy()

In [88]:
df3

                   A         B         C         D
2020-11-10 -0.275941 -0.459333 -0.896176  0.795974
2020-11-14  0.772325 -0.231398  0.304636  0.219861
2020-11-11  0.350726 -0.017860  0.137921  1.892543
2020-11-12  0.049141  0.121610  0.793791 -3.154830
2020-11-09  1.556292  0.309726 -0.165791 -0.587107
2020-11-13  0.671041  1.291864  2.027798 -1.435069

In [91]:
df3['E'] = ['one', 'one', 'two', 'three', 'four', 'three'] # 새로운 열 추가
df3

                   A         B         C         D      E
2020-11-10 -0.275941 -0.459333 -0.896176  0.795974    one
2020-11-14  0.772325 -0.231398  0.304636  0.219861    one
2020-11-11  0.350726 -0.017860  0.137921  1.892543    two
2020-11-12  0.049141  0.121610  0.793791 -3.154830  three
2020-11-09  1.556292  0.309726 -0.165791 -0.587107   four
2020-11-13  0.671041  1.291864  2.027798 -1.435069  three

In [95]:
df3['E'].isin(['two','four'])

2020-11-10    False
2020-11-14    False
2020-11-11     True
2020-11-12    False
2020-11-09     True
2020-11-13    False
Name: E, dtype: bool

* isin : 컬럼 E에 two 혹은 four 가 있는지 조건을 건다

In [96]:
df3[df3['E'].isin(['two','four'])]

                   A         B         C         D     E
2020-11-11  0.350726 -0.017860  0.137921  1.892543   two
2020-11-09  1.556292  0.309726 -0.165791 -0.587107  four

* isin 명령어 결과가 True 혹은 False로 반환되기에 이를 이용해 위처럼 조건에 맞는 데이터만 선택 가능

### 데이터프레임에 특정 함수 적용하기 : apply

In [97]:
df.apply(np.cumsum)

                   A         B         C         D
2020-11-10 -0.275941 -0.459333 -0.896176  0.795974
2020-11-14  0.496384 -0.690732 -0.591540  1.015835
2020-11-11  0.847110 -0.708592 -0.453620  2.908378
2020-11-12  0.896251 -0.586982  0.340172 -0.246453
2020-11-09  2.452543 -0.277255  0.174381 -0.833560
2020-11-13  3.123583  1.014608  2.202179 -2.268629

* 누적 합 구하기

In [98]:
df.apply(lambda x: x.max() - x.min())

A    1.832233
B    1.751197
C    2.923975
D    5.047373
dtype: float64

* 최대값과 최소값의 차이(거리)를 알고 싶은 경우 lambda를 위와 같이 사용할 수 있다
* 각 컬럼별로 최대 최소 차이